[{"challenge": "Write a program which will find all such numbers which are divisible by 7 but are not a multiple of 5,between 2000 and 3200 (both included).The numbers obtained should be printed in a comma-separated sequence on a single line.Hints: Consider use range(#begin, #end) methodSolution:l=[]for i in range(2000, 3201):    if (i%7==0) and (i%5!=0):        l.append(str(i))print ','.join(l)", "id": 1, "level": "easy"}, {"challenge": "Write a program which can compute the factorial of a given numbers.The results should be printed in a comma-separated sequence on a single line.Suppose the following input is supplied to the program:8Then, the output should be:40320", "id": 2, "level": "easy"}, {"challenge": "With a given integral number n, write a program to generate a dictionary that contains (i, i*i) such that is an integral number between 1 and n (both included). and then the program should print the dictionary.Suppose the following input is supplied to the program:8Then, the output should be:{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64}", "id": 3, "level": "easy"}, {"challenge": "Write a program which accepts a sequence of comma-separated numbers from console and generate a list and a tuple which contains every number.Suppose the following input is supplied to the program:34,67,55,33,12,98Then, the output should be:['34', '67', '55', '33', '12', '98']('34', '67', '55', '33', '12', '98')", "id": 4, "level": "easy"}, {"challenge": "Define a class which has at least two methods:getString: to get a string from console inputprintString: to print the string in upper case.Also please include simple test function to test the class methods.", "id": 5, "level": "easy"}, {"challenge": "Write a program that calculates and prints the value according to the given formula:Q = Square root of [(2 * C * D)/H]Following are the fixed values of C and H:C is 50. H is 30.D is the variable whose values should be input to your program in a comma-separated sequence.ExampleLet us assume the following comma separated input sequence is given to the program:100,150,180The output of the program should be:18,22,24", "id": 6, "level": "medium"}, {"challenge": "Write a program which takes 2 digits, X,Y as input and generates a 2-dimensional array. The element value in the i-th row and j-th column of the array should be i*j.Note: i=0,1.., X-1; j=0,1,¡­Y-1.ExampleSuppose the following inputs are given to the program:3,5Then, the output of the program should be:[[0, 0, 0, 0, 0], [0, 1, 2, 3, 4], [0, 2, 4, 6, 8]] ", "id": 7, "level": "medium"}, {"challenge": "Write a program that accepts a comma separated sequence of words as input and prints the words in a comma-separated sequence after sorting them alphabetically.Suppose the following input is supplied to the program:without,hello,bag,worldThen, the output should be:bag,hello,without,world", "id": 8, "level": "medium"}, {"challenge": "Write a program that accepts sequence of lines as input and prints the lines after making all characters in the sentence capitalized.Suppose the following input is supplied to the program:Hello worldPractice makes perfectThen, the output should be:HELLO WORLDPRACTICE MAKES PERFECT", "id": 9, "level": "medium"}, {"challenge": "Write a program that accepts a sequence of whitespace separated words as input and prints the words after removing all duplicate words and sorting them alphanumerically.Suppose the following input is supplied to the program:hello world and practice makes perfect and hello world againThen, the output should be:again and hello makes perfect practice world", "id": 10, "level": "medium"}, {"challenge": "Write a program which accepts a sequence of comma separated 4 digit binary numbers as its input and then check whether they are divisible by 5 or not. The numbers that are divisible by 5 are to be printed in a comma separated sequence.Example:0100,0011,1010,1001Then the output should be:1010Notes: Assume the data is input by console.", "id": 11, "level": "medium"}, {"challenge": "Write a program, which will find all such numbers between 1000 and 3000 (both included) such that each digit of the number is an even number.The numbers obtained should be printed in a comma-separated sequence on a single line.", "id": 12, "level": "medium"}, {"challenge": "Write a program that accepts a sentence and calculate the number of letters and digits.Suppose the following input is supplied to the program:hello world! 123Then, the output should be:LETTERS 10DIGITS 3", "id": 13, "level": "medium"}, {"challenge": "Write a program that accepts a sentence and calculate the number of upper case letters and lower case letters.Suppose the following input is supplied to the program:Hello world!Then, the output should be:UPPER CASE 1LOWER CASE 9", "id": 14, "level": "medium"}, {"challenge": "Write a program that computes the value of a+aa+aaa+aaaa with a given digit as the value of a.Suppose the following input is supplied to the program:9Then, the output should be:11106", "id": 15, "level": "medium"}, {"challenge": "Use a list comprehension to square each odd number in a list. The list is input by a sequence of comma-separated numbers.Suppose the following input is supplied to the program:1,2,3,4,5,6,7,8,9Then, the output should be:1,3,5,7,9", "id": 16, "level": "medium"}, {"challenge": "Write a program that computes the net amount of a bank account based a transaction log from console input. The transaction log format is shown as following:D 100W 200D means deposit while W means withdrawal.Suppose the following input is supplied to the program:D 300D 300W 200D 100Then, the output should be:500", "id": 17, "level": "medium"}, {"challenge": "A website requires the users to input username and password to register. Write a program to check the validity of password input by users.Following are the criteria for checking the password:1. At least 1 letter between [a-z]2. At least 1 number between [0-9]1. At least 1 letter between [A-Z]3. At least 1 character from [$#@]4. Minimum length of transaction password: 65. Maximum length of transaction password: 12Your program should accept a sequence of comma separated passwords and will check them according to the above criteria. Passwords that match the criteria are to be printed, each separated by a comma.ExampleIf the following passwords are given as input to the program:ABd1234@1,a F1#,2w3E*,2We3345Then, the output of the program should be:ABd1234@1", "id": 18, "level": "hard"}, {"challenge": "You are required to write a program to sort the (name, age, height) tuples by ascending order where name is string, age and height are numbers. The tuples are input by console. The sort criteria is:1: Sort based on name;2: Then sort based on age;3: Then sort by score.The priority is that name > age > score.If the following tuples are given as input to the program:Tom,19,80John,20,90Jony,17,91Jony,17,93Json,21,85Then, the output of the program should be:[('John', '20', '90'), ('Jony', '17', '91'), ('Jony', '17', '93'), ('Json', '21', '85'), ('Tom', '19', '80')]", "id": 19, "level": "hard"}, {"challenge": "Define a class with a generator which can iterate the numbers, which are divisible by 7, between a given range 0 and n.", "id": 20, "level": "hard"}, {"challenge": "A robot moves in a plane starting from the original point (0,0). The robot can move toward UP, DOWN, LEFT and RIGHT with a given steps. The trace of robot movement is shown as the following:UP 5DOWN 3LEFT 3RIGHT 2¡­The numbers after the direction are steps. Please write a program to compute the distance from current position after a sequence of movement and original point. If the distance is a float, then just print the nearest integer.Example:If the following tuples are given as input to the program:UP 5DOWN 3LEFT 3RIGHT 2Then, the output of the program should be:2", "id": 21, "level": "hard"}, {"challenge": "Write a program to compute the frequency of the words from the input. The output should output after sorting the key alphanumerically. Suppose the following input is supplied to the program:New to Python or choosing between Python 2 and Python 3? Read Python 2 or Python 3.Then, the output should be:2:23.:13?:1New:1Python:5Read:1and:1between:1choosing:1or:2to:1HintsIn case of input data being supplied to the question, it should be assumed to be a console input.Solution:freq = {}   # frequency of words in textline = raw_input()for word in line.split():    freq[word] = freq.get(word,0)+1words = freq.keys()words.sort()for w in words:    print \"%s:%d\" % (w,freq[w])", "id": 22, "level": "hard"}, {"challenge": "    Write a method which can calculate square value of number", "id": 23, "level": "hard"}, {"challenge": "    Python has many built-in functions, and if you do not know how to use it, you can read document online or find some books. But Python has a built-in document function for every built-in functions.    Please write a program to print some Python built-in functions documents, such as abs(), int(), raw_input()    And add document for your own function    ", "id": 24, "level": "easy"}, {"challenge": "    Define a class, which have a class parameter and have a same instance parameter.", "id": 25, "level": "easy"}, {"challenge": "Nothing", "hint": "sorry :)", "id": 26, "level": "hard"}, {"challenge": "Evan", "hint": "sorry :)", "id": 27, "level": "hard"}]